-- phpMyAdmin SQL Dump
-- version 5.2.2
-- https://www.phpmyadmin.net/
--
-- Servidor: localhost:3306
-- Tiempo de generación: 14-03-2026 a las 00:03:47
-- Versión del servidor: 8.0.45
-- Versión de PHP: 8.3.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Base de datos: `xido_100mexicanos`
--

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `categories`
--

CREATE TABLE `categories` (
  `id` int NOT NULL,
  `name` varchar(100) NOT NULL,
  `description` text,
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Volcado de datos para la tabla `categories`
--

INSERT INTO `categories` (`id`, `name`, `description`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'Comida y cocina', 'Alimentos, bebidas, cocinar, antojos y hábitos al comer', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(2, 'Familia y relaciones', 'Parientes, convivencia familiar, roles y dinámicas entre familiares', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(3, 'Pareja y amor', 'Citas, romance, convivencia en pareja, conflictos y detalles amorosos', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(4, 'Trabajo y dinero', 'Empleo, oficios, ingresos, gastos, deudas y finanzas personales', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(5, 'Escuela y estudio', 'Tareas, exámenes, materias, maestros, vida estudiantil y aprendizaje', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(6, 'Hogar y rutina', 'Actividades diarias en casa, limpieza, organización y costumbres', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(7, 'Salud y cuerpo', 'Síntomas, hábitos saludables, cuidado personal, cuerpo y bienestar', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(8, 'Ocio y entretenimiento', 'TV, música, juegos, pasatiempos, salir y diversión', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(9, 'Tecnología y redes', 'Celular, apps, internet, redes sociales, gadgets y uso digital', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(10, 'Compras y consumo', 'Supermercado, tiendas, marcas, gastos comunes y decisiones de compra', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(11, 'Viajes y transporte', 'Traslados, tráfico, transporte público, carretera, vacaciones y viajes', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(12, 'Fiestas y celebraciones', 'Cumpleaños, reuniones, eventos, tradiciones y festejos', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(13, 'Deportes y hobbies', 'Actividades deportivas, ejercicio, aficiones y tiempo libre activo', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(14, 'México y cultura', 'Costumbres mexicanas, comida típica, tradiciones, referencias culturales', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(15, 'Animales y mascotas', 'Mascotas, cuidados, comportamientos de animales y vida con ellos', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(16, 'Naturaleza y clima', 'Clima, estaciones, fenómenos naturales, campo y ambiente', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(17, 'Emociones y hábitos', 'Conductas comunes, manías, rutinas mentales y reacciones emocionales', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(18, 'Miedos y supersticiones', 'Fobias, sustos, creencias, supersticiones y cosas que dan miedo', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(19, 'Lugares y ciudad', 'Sitios, espacios públicos, negocios, colonias, ciudad y vida urbana', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(20, 'Lenguaje y dichos', 'Frases, expresiones, palabras comunes, modismos y dichos', 1, '2025-12-17 00:17:48', '2025-12-17 00:17:48'),
(21, 'Vida nocturna', 'Aspectos y personajes comunes en la vida nocturna', 1, '2025-12-23 20:39:24', '2025-12-23 20:39:24'),
(22, 'Animales y mascotas', 'Mascotas, cuidados, comportamientos de animales y vida con ellos', 1, '2025-12-23 20:52:00', '2025-12-23 20:52:00'),
(23, 'Historia y religión', 'Eventos históricos y aspectos religiosos', 1, '2025-12-23 21:25:54', '2025-12-23 21:25:54'),
(24, 'Transporte acuático', 'Tipos de barcos y actividades relacionadas con el agua', 1, '2025-12-23 21:51:27', '2025-12-23 21:51:27'),
(25, 'Objetos que se descomponen', 'Cosas que suelen fallar o romperse', 1, '2025-12-23 21:51:27', '2025-12-23 21:51:27'),
(26, 'Estilo y moda', 'Ropa, accesorios y tendencias de moda', 1, '2025-12-23 22:00:33', '2025-12-23 22:00:33'),
(27, 'Sueños de infancia', 'Profesiones que los niños sueñan con ser de grandes', 1, '2025-12-23 22:11:54', '2025-12-23 22:11:54');

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `games`
--

CREATE TABLE `games` (
  `id` int NOT NULL,
  `title` varchar(200) NOT NULL,
  `target_score` int NOT NULL DEFAULT '300',
  `status` enum('pending','running','finished') DEFAULT 'pending',
  `current_round_number` int DEFAULT '0',
  `team_a_name` varchar(100) NOT NULL,
  `team_b_name` varchar(100) NOT NULL,
  `team_a_score` int DEFAULT '0',
  `team_b_score` int DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Volcado de datos para la tabla `games`
--

INSERT INTO `games` (`id`, `title`, `target_score`, `status`, `current_round_number`, `team_a_name`, `team_b_name`, `team_a_score`, `team_b_score`, `created_at`, `updated_at`) VALUES
(1, '100 Mexicanos Dijeron', 300, 'pending', 0, 'Equipo A', 'Equipo B', 0, 0, '2025-12-19 23:46:21', '2025-12-19 23:46:21'),
(2, '100 Mexicanos Dijeron', 300, 'pending', 0, 'Equipo A', 'Equipo B', 0, 0, '2025-12-20 05:52:24', '2025-12-20 05:52:24'),
(3, '100 Mexicanos Dijeron', 300, 'running', 4, 'Prueba A', 'Prueba B', 158, 154, '2025-12-25 03:01:09', '2025-12-25 03:53:59'),
(4, '100 Mexicanos Dijeron', 300, 'finished', 6, 'Los Panches', 'Los Peters', 261, 314, '2025-12-25 06:47:51', '2026-01-03 20:08:25'),
(5, '100 Peters Dijeron', 500, 'running', 11, 'Los Panches', 'Los Peters', 687, 437, '2025-12-25 07:10:24', '2025-12-25 07:41:20'),
(6, '100 Mexicanos Dijeron', 300, 'finished', 6, 'Los Leones', 'Los Jelou2', 344, 247, '2026-01-03 20:15:56', '2026-01-03 20:34:34'),
(7, '100 Mexicanos Dijeron', 500, 'finished', 5, 'Los Leones', 'Los Jelou2', 730, 83, '2026-01-03 20:36:22', '2026-01-03 20:50:18'),
(8, '100 Mexicanos Dijeron', 300, 'running', 1, 'Equipo A', 'Equipo B', 0, 0, '2026-03-14 04:29:49', '2026-03-14 04:33:48'),
(9, '100 Mexicanos Dijeron', 300, 'running', 4, 'AAA', 'BBB', 100, 300, '2026-03-14 04:59:07', '2026-03-14 05:31:24'),
(10, '100 Mexicanos Dijeron', 300, 'running', 2, 'Niños', 'Niñas', 92, 164, '2026-03-14 05:43:07', '2026-03-14 05:57:56');

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `questions`
--

CREATE TABLE `questions` (
  `id` int NOT NULL,
  `category_id` int NOT NULL,
  `text` text NOT NULL,
  `is_active` tinyint(1) DEFAULT '1',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Volcado de datos para la tabla `questions`
--

INSERT INTO `questions` (`id`, `category_id`, `text`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 2, 'Además de pañales, ¿qué más necesita un bebé?', 1, '2025-12-17 00:19:53', '2025-12-17 00:19:53'),
(2, 19, 'Características que definen a un naco o \nfresa', 1, '2025-12-17 00:19:53', '2025-12-23 22:04:29'),
(3, 10, 'Menciona algo que es más barato comprar en el mercado que en es super', 1, '2025-12-17 00:19:53', '2025-12-23 20:46:21'),
(4, 19, '¿Qué encuentras comúnmente en un parque?', 1, '2025-12-17 00:19:53', '2025-12-17 00:19:53'),
(5, 15, 'Además de pollo, diga un animal que nazca de un huevo.', 1, '2025-12-23 20:32:09', '2025-12-23 20:32:09'),
(6, 13, 'Nombre un deporte Olímpico', 1, '2025-12-23 20:32:09', '2025-12-23 20:32:09'),
(7, 15, 'Mencione un animal que puedas encontrar en un circo.', 1, '2025-12-23 20:32:09', '2025-12-23 20:32:09'),
(8, 7, 'Mencione una parte del cuerpo donde la gente se pone un tatuaje.', 1, '2025-12-23 20:32:09', '2025-12-23 20:32:09'),
(9, 21, 'Características de un cadenero de un antro', 1, '2025-12-23 20:39:24', '2025-12-23 20:39:24'),
(10, 5, 'Menciona algún motivo por el cual pueden llevar a un niño a la dirección', 1, '2025-12-23 20:39:24', '2025-12-23 20:39:24'),
(11, 8, 'Qué hace un hombre mexicano en su tiempo libre', 1, '2025-12-23 20:39:24', '2025-12-23 20:39:24'),
(12, 11, 'Menciona que no debe faltar cuando sales de viaje', 1, '2025-12-23 20:39:24', '2025-12-23 20:39:24'),
(13, 21, '¿Adónde vas comúnmente el fin de semana?', 1, '2025-12-23 20:52:00', '2025-12-23 20:52:00'),
(14, 22, 'Dime algo para lo que en la antigüedad, no le pedían su opinión a la mujer.', 1, '2025-12-23 20:52:00', '2025-12-23 20:52:00'),
(15, 6, 'Menciona objetos que comúnmente pierdes.', 1, '2025-12-23 20:52:00', '2025-12-23 20:52:00'),
(16, 5, 'Dime un color que comúnmente se usa para el suéter de un uniforme escolar.', 1, '2025-12-23 20:52:00', '2025-12-23 20:52:00'),
(17, 6, 'Dinos algo que forma parte de la decoración de una casa.', 1, '2025-12-23 20:57:10', '2025-12-23 20:57:10'),
(18, 3, 'Menciona qué es lo primero que viene a tu mente cuando escuchas la palabra \'parejas\'.', 1, '2025-12-23 20:57:10', '2025-12-23 20:57:10'),
(19, 12, 'Dinos una ocasión propicia para regalar flores.', 1, '2025-12-23 20:57:10', '2025-12-23 20:57:10'),
(20, 10, 'Menciona un artículo que puedes comprar en una ferretería.', 1, '2025-12-23 20:57:10', '2025-12-23 20:57:10'),
(21, 22, 'Menciona un insecto que tenga antenas.', 1, '2025-12-23 21:01:57', '2025-12-23 21:01:57'),
(22, 7, 'Tiempo promedio que tarda una mujer en arreglarse.', 1, '2025-12-23 21:01:57', '2025-12-23 21:01:57'),
(23, 22, 'Menciona un animal en peligro de extinción.', 1, '2025-12-23 21:01:57', '2025-12-23 21:01:57'),
(24, 3, 'Menciona algo en lo que se fija una mujer de un hombre.', 1, '2025-12-23 21:01:57', '2025-12-23 21:01:57'),
(25, 18, 'Dime algo a lo que los niños le temen', 1, '2025-12-23 21:07:55', '2025-12-23 21:07:55'),
(26, 17, 'Menciona algo que la gente hace cuando está feliz', 1, '2025-12-23 21:07:55', '2025-12-23 21:07:55'),
(27, 7, 'Específica algo que debe hacerse en ayunas', 1, '2025-12-23 21:07:55', '2025-12-23 21:07:55'),
(28, 14, 'Además de Pérez, menciona un apellido muy común en México', 1, '2025-12-23 21:07:55', '2025-12-23 21:07:55'),
(29, 19, 'Menciona un lugar al que no quieren ir los niños', 1, '2025-12-23 21:18:35', '2025-12-23 21:18:35'),
(30, 17, 'Menciona algo que hace un hombre mal educado.', 1, '2025-12-23 21:18:35', '2025-12-23 21:18:35'),
(31, 15, 'Menciona una raza de perro.', 1, '2025-12-23 21:18:35', '2025-12-23 21:18:35'),
(32, 4, 'Dime qué es lo primero que harías si te ganaras la lotería.', 1, '2025-12-23 21:18:35', '2025-12-23 21:18:35'),
(33, 1, 'Dinos algo que comes sin masticar.', 1, '2025-12-23 21:25:54', '2025-12-23 21:25:54'),
(34, 23, 'Dinos algo que ver con la inquisición.', 1, '2025-12-23 21:25:54', '2025-12-23 21:25:54'),
(35, 5, 'Menciona la materia más difícil que llevaste cuando ibas a la escuela.', 1, '2025-12-23 21:25:54', '2025-12-23 21:25:54'),
(36, 7, 'Además de los oídos, dinos una parte del cuerpo donde los niños se ponen un piercing.', 1, '2025-12-23 21:25:54', '2025-12-23 21:25:54'),
(37, 22, 'Menciona un animal doméstico', 1, '2025-12-23 21:30:26', '2025-12-23 21:30:26'),
(38, 22, 'Menciona el nombre de un animal que tenga pico', 1, '2025-12-23 21:30:27', '2025-12-23 21:30:27'),
(39, 10, 'Menciona algo en lo que las mujeres pueden gastar todo su dinero', 1, '2025-12-23 21:30:27', '2025-12-23 21:30:27'),
(40, 22, 'Menciona un animal de muchos dientes', 1, '2025-12-23 21:30:27', '2025-12-23 21:30:27'),
(41, 24, 'Según su actividad, menciona algun tipo de barco.', 1, '2025-12-23 21:51:27', '2025-12-23 21:51:27'),
(42, 25, 'Menciona que suele decorar el espejo retrovisor de un carro', 1, '2025-12-23 21:51:27', '2025-12-23 21:51:27'),
(43, 12, 'Dinos un disfraz recurrente para los niños en Halloween.', 1, '2025-12-23 21:51:27', '2025-12-23 21:51:27'),
(44, 16, 'Dinos que animal es utilizado para insultar a una persona', 1, '2025-12-23 21:51:27', '2025-12-23 21:51:27'),
(45, 12, 'Menciona algo que no debe faltar en una fiesta infantil.', 1, '2025-12-23 22:00:33', '2025-12-23 22:00:33'),
(46, 5, 'Cita algo que no puede faltar en un salón de clases.', 1, '2025-12-23 22:00:33', '2025-12-23 22:00:33'),
(47, 26, 'Di algo que actualmente la mujer considera estético, y que, no hubieran aprobado nuestras abuelitas.', 1, '2025-12-23 22:00:33', '2025-12-23 22:00:33'),
(48, 17, 'Menciona un propósito que la gente hace en año nuevo.', 1, '2025-12-23 22:00:33', '2025-12-23 22:00:33'),
(49, 12, 'Menciona un elemento típico de las posadas', 1, '2025-12-23 22:02:59', '2025-12-23 22:02:59'),
(50, 4, 'Trabajo donde no es muy común encontrar a una mujer', 1, '2025-12-23 22:02:59', '2025-12-23 22:02:59'),
(51, 15, 'Dinos el nombre de un animal grande', 1, '2025-12-23 22:02:59', '2025-12-23 22:02:59'),
(52, 14, 'Menciona un juguete tradicional mexicano', 1, '2025-12-23 22:02:59', '2025-12-23 22:02:59'),
(53, 4, 'Menciona un trabajo en el que necesites usar guantes.', 1, '2025-12-23 22:11:54', '2025-12-23 22:11:54'),
(54, 27, 'Menciona una profesión que cuando eras niño soñabas con llegar a serlo.', 1, '2025-12-23 22:11:54', '2025-12-23 22:11:54'),
(55, 18, 'Menciona un animal que resulta ser molesto', 1, '2025-12-23 22:11:54', '2025-12-23 22:11:54'),
(56, 23, 'Dime el nombre de algún presidente de México no tan actual', 1, '2025-12-23 22:11:54', '2025-12-23 22:11:54'),
(57, 22, 'Menciona un animal venenoso', 1, '2026-01-27 21:41:58', '2026-01-27 21:41:58');

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `question_answers`
--

CREATE TABLE `question_answers` (
  `id` int NOT NULL,
  `question_id` int NOT NULL,
  `text` varchar(255) NOT NULL,
  `points` int NOT NULL,
  `position` int NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Volcado de datos para la tabla `question_answers`
--

INSERT INTO `question_answers` (`id`, `question_id`, `text`, `points`, `position`, `created_at`) VALUES
(1, 1, 'Mamila', 28, 1, '2025-12-17 00:19:53'),
(2, 1, 'Cuna', 26, 2, '2025-12-17 00:19:53'),
(3, 1, 'Chupón', 23, 3, '2025-12-17 00:19:53'),
(4, 1, 'Juguetes', 13, 4, '2025-12-17 00:19:53'),
(5, 1, 'Ropita', 10, 5, '2025-12-17 00:19:53'),
(16, 4, 'Árboles', 42, 1, '2025-12-17 00:19:53'),
(17, 4, 'Juegos', 25, 2, '2025-12-17 00:19:53'),
(18, 4, 'Niños', 16, 3, '2025-12-17 00:19:53'),
(19, 4, 'Perros', 13, 4, '2025-12-17 00:19:53'),
(20, 4, 'Pájaros', 4, 5, '2025-12-17 00:19:53'),
(31, 5, 'Víbora', 27, 1, '2025-12-23 20:32:09'),
(32, 5, 'Cocodrilo', 26, 2, '2025-12-23 20:32:09'),
(33, 5, 'Tortuga', 24, 3, '2025-12-23 20:32:09'),
(34, 5, 'Pez', 19, 4, '2025-12-23 20:32:09'),
(35, 5, 'Pato', 4, 5, '2025-12-23 20:32:09'),
(36, 6, 'Natación', 48, 1, '2025-12-23 20:32:09'),
(37, 6, 'Fútbol', 26, 2, '2025-12-23 20:32:09'),
(38, 6, 'Caminata', 16, 3, '2025-12-23 20:32:09'),
(39, 6, 'Gimnasia', 5, 4, '2025-12-23 20:32:09'),
(40, 6, 'Ciclismo', 5, 5, '2025-12-23 20:32:09'),
(41, 7, 'Elefante', 27, 1, '2025-12-23 20:32:09'),
(42, 7, 'Changos', 24, 2, '2025-12-23 20:32:09'),
(43, 7, 'Tigres/Leones', 23, 3, '2025-12-23 20:32:09'),
(44, 7, 'Camello', 10, 4, '2025-12-23 20:32:09'),
(45, 7, 'Caballo', 10, 5, '2025-12-23 20:32:09'),
(46, 8, 'Brazos', 38, 1, '2025-12-23 20:32:09'),
(47, 8, 'Espalda', 31, 2, '2025-12-23 20:32:09'),
(48, 8, 'Codos', 23, 3, '2025-12-23 20:32:09'),
(49, 8, 'Pantorrilla', 3, 4, '2025-12-23 20:32:09'),
(50, 8, 'Muñeca', 3, 5, '2025-12-23 20:32:09'),
(51, 9, 'Gordo', 38, 1, '2025-12-23 20:39:24'),
(52, 9, 'Alto', 31, 2, '2025-12-23 20:39:24'),
(53, 9, 'Sangrón', 23, 3, '2025-12-23 20:39:24'),
(54, 9, 'Lentes oscuros', 5, 4, '2025-12-23 20:39:24'),
(55, 9, 'Viste de negro', 3, 5, '2025-12-23 20:39:24'),
(56, 10, 'Mala conducta', 27, 1, '2025-12-23 20:39:24'),
(57, 10, 'Por pelearse', 26, 2, '2025-12-23 20:39:24'),
(58, 10, 'Por grosero', 24, 3, '2025-12-23 20:39:24'),
(59, 10, 'Por no hacer tarea', 19, 4, '2025-12-23 20:39:24'),
(60, 10, 'Por salirse del salón', 4, 5, '2025-12-23 20:39:24'),
(61, 11, 'Ver la tele', 35, 1, '2025-12-23 20:39:24'),
(62, 11, 'Dormir', 24, 2, '2025-12-23 20:39:24'),
(63, 11, 'Jugar futbol', 18, 3, '2025-12-23 20:39:24'),
(64, 11, 'Salir con los cuates', 8, 4, '2025-12-23 20:39:24'),
(65, 11, 'Videjuegos', 7, 5, '2025-12-23 20:39:24'),
(66, 12, 'Maletas', 28, 1, '2025-12-23 20:39:24'),
(67, 12, 'Dinero', 26, 2, '2025-12-23 20:39:24'),
(68, 12, 'Ropa/traje de baño', 25, 3, '2025-12-23 20:39:24'),
(69, 12, 'Boletos', 13, 4, '2025-12-23 20:39:24'),
(70, 12, 'Lentes de sol', 8, 5, '2025-12-23 20:39:24'),
(81, 3, 'Frutas/verduras', 33, 1, '2025-12-23 20:46:21'),
(82, 3, 'Ropa', 26, 2, '2025-12-23 20:46:21'),
(83, 3, 'Carne ', 22, 3, '2025-12-23 20:46:21'),
(84, 3, 'Huevo', 14, 4, '2025-12-23 20:46:21'),
(85, 3, 'Azucar', 5, 5, '2025-12-23 20:46:21'),
(86, 13, 'Al antro/bar', 28, 1, '2025-12-23 20:52:00'),
(87, 13, 'Al cine', 26, 2, '2025-12-23 20:52:00'),
(88, 13, 'Al mercado/super', 23, 3, '2025-12-23 20:52:00'),
(89, 13, 'A la iglesia', 10, 4, '2025-12-23 20:52:00'),
(90, 13, 'Te quedas en casa', 7, 5, '2025-12-23 20:52:00'),
(91, 14, 'Votar', 39, 1, '2025-12-23 20:52:00'),
(92, 14, 'Casarse', 36, 2, '2025-12-23 20:52:00'),
(93, 14, 'Política', 10, 3, '2025-12-23 20:52:00'),
(94, 14, 'Tener hijos', 8, 4, '2025-12-23 20:52:00'),
(95, 14, 'Elegir la casa', 7, 5, '2025-12-23 20:52:00'),
(96, 15, 'Llaves', 27, 1, '2025-12-23 20:52:00'),
(97, 15, 'Dinero', 25, 2, '2025-12-23 20:52:00'),
(98, 15, 'Monedero/cartera', 24, 3, '2025-12-23 20:52:00'),
(99, 15, 'Encendedor', 14, 4, '2025-12-23 20:52:00'),
(100, 15, 'Lentes', 7, 5, '2025-12-23 20:52:00'),
(101, 16, 'Verde', 31, 1, '2025-12-23 20:52:00'),
(102, 16, 'Azul', 28, 2, '2025-12-23 20:52:00'),
(103, 16, 'Vino/rojo', 23, 3, '2025-12-23 20:52:00'),
(104, 16, 'Café', 11, 4, '2025-12-23 20:52:00'),
(105, 16, 'Blanco', 7, 5, '2025-12-23 20:52:00'),
(106, 17, 'Cuadros', 37, 1, '2025-12-23 20:57:10'),
(107, 17, 'Plantas', 36, 2, '2025-12-23 20:57:10'),
(108, 17, 'Florero', 21, 3, '2025-12-23 20:57:10'),
(109, 17, 'Muebles', 4, 4, '2025-12-23 20:57:10'),
(110, 17, 'Cortinas', 3, 5, '2025-12-23 20:57:10'),
(111, 18, 'Amor', 33, 1, '2025-12-23 20:57:10'),
(112, 18, 'Flecha', 28, 2, '2025-12-23 20:57:10'),
(113, 18, 'Alas', 23, 3, '2025-12-23 20:57:10'),
(114, 18, 'Parejas', 17, 4, '2025-12-23 20:57:10'),
(115, 18, 'Besos', 3, 5, '2025-12-23 20:57:10'),
(116, 19, 'Cumpleaños', 29, 1, '2025-12-23 20:57:10'),
(117, 19, 'Aniversario', 28, 2, '2025-12-23 20:57:10'),
(118, 19, 'Día de la Madre', 26, 3, '2025-12-23 20:57:10'),
(119, 19, 'Velorio', 9, 4, '2025-12-23 20:57:10'),
(120, 19, '14 de Febrero', 8, 5, '2025-12-23 20:57:10'),
(121, 20, 'Herramienta', 37, 1, '2025-12-23 20:57:10'),
(122, 20, 'Clavos', 25, 2, '2025-12-23 20:57:10'),
(123, 20, 'Cemento', 20, 3, '2025-12-23 20:57:10'),
(124, 20, 'Yeso', 20, 4, '2025-12-23 20:57:10'),
(125, 20, 'Pintura', 9, 5, '2025-12-23 20:57:10'),
(126, 21, 'Cucaracha', 37, 1, '2025-12-23 21:01:57'),
(127, 21, 'Mariposa', 33, 2, '2025-12-23 21:01:57'),
(128, 21, 'Cochinilla', 13, 3, '2025-12-23 21:01:57'),
(129, 21, 'Saltamontes/Grillo', 10, 4, '2025-12-23 21:01:57'),
(130, 21, 'Hormigas', 7, 5, '2025-12-23 21:01:57'),
(131, 22, '2 horas', 29, 1, '2025-12-23 21:01:57'),
(132, 22, '1 hora', 28, 2, '2025-12-23 21:01:57'),
(133, 22, '45 minutos', 26, 3, '2025-12-23 21:01:57'),
(134, 22, '30 minutos', 9, 4, '2025-12-23 21:01:57'),
(135, 22, '15 minutos', 8, 5, '2025-12-23 21:01:57'),
(136, 23, 'Axolote', 36, 1, '2025-12-23 21:01:57'),
(137, 23, 'Guacamaya', 25, 2, '2025-12-23 21:01:57'),
(138, 23, 'Jaguar', 18, 3, '2025-12-23 21:01:57'),
(139, 23, 'Oso Panda', 10, 4, '2025-12-23 21:01:57'),
(140, 23, 'Gorila', 5, 5, '2025-12-23 21:01:57'),
(141, 24, 'Ojos', 40, 1, '2025-12-23 21:01:57'),
(142, 24, 'Manos', 33, 2, '2025-12-23 21:01:57'),
(143, 24, 'Forma de vestir', 10, 3, '2025-12-23 21:01:57'),
(144, 24, 'Cara', 9, 4, '2025-12-23 21:01:57'),
(145, 24, 'Pompas', 8, 5, '2025-12-23 21:01:57'),
(146, 25, 'OSCURIDAD', 33, 1, '2025-12-23 21:07:55'),
(147, 25, 'DOCTOR', 31, 2, '2025-12-23 21:07:55'),
(148, 25, 'AL \'COCO\'', 19, 3, '2025-12-23 21:07:55'),
(149, 25, 'INYECCIONES', 9, 4, '2025-12-23 21:07:55'),
(150, 25, 'A LOS PAPAS', 8, 5, '2025-12-23 21:07:55'),
(151, 26, 'REIR', 37, 1, '2025-12-23 21:07:55'),
(152, 26, 'BRINCA', 22, 2, '2025-12-23 21:07:55'),
(153, 26, 'CANTA', 19, 3, '2025-12-23 21:07:55'),
(154, 26, 'SILBA', 7, 4, '2025-12-23 21:07:55'),
(155, 26, 'TOMA/BEBE', 5, 5, '2025-12-23 21:07:55'),
(156, 27, 'ANÁLISIS CLÍNICOS', 48, 1, '2025-12-23 21:07:55'),
(157, 27, 'TOMAR LÍQUIDOS', 23, 2, '2025-12-23 21:07:55'),
(158, 27, 'HACER EJERCICIO', 14, 3, '2025-12-23 21:07:55'),
(159, 27, 'DESAYUNAR', 11, 4, '2025-12-23 21:07:55'),
(160, 27, 'LAVARTE LOS DIENTES', 4, 5, '2025-12-23 21:07:55'),
(161, 28, 'LÓPEZ', 39, 1, '2025-12-23 21:07:55'),
(162, 28, 'GARCÍA', 30, 2, '2025-12-23 21:07:55'),
(163, 28, 'GONZÁLEZ', 24, 3, '2025-12-23 21:07:55'),
(164, 28, 'HERNÁNDEZ', 5, 4, '2025-12-23 21:07:55'),
(165, 28, 'SÁNCHEZ', 2, 5, '2025-12-23 21:07:55'),
(166, 29, 'Dentista', 38, 1, '2025-12-23 21:18:35'),
(167, 29, 'Medico', 31, 2, '2025-12-23 21:18:35'),
(168, 29, 'Escuela', 23, 3, '2025-12-23 21:18:35'),
(169, 29, 'Museos', 5, 4, '2025-12-23 21:18:35'),
(170, 29, 'Iglesia', 3, 5, '2025-12-23 21:18:35'),
(171, 30, 'Escupe', 41, 1, '2025-12-23 21:18:35'),
(172, 30, 'Dice groserías', 31, 2, '2025-12-23 21:18:35'),
(173, 30, 'Eructa', 15, 3, '2025-12-23 21:18:35'),
(174, 30, 'Se pica la nariz', 10, 4, '2025-12-23 21:18:35'),
(175, 30, 'Hace en la calle', 3, 5, '2025-12-23 21:18:35'),
(176, 31, 'Pastor Alemán', 37, 1, '2025-12-23 21:18:35'),
(177, 31, 'Labrador', 31, 2, '2025-12-23 21:18:35'),
(178, 31, 'Rottweiler', 24, 3, '2025-12-23 21:18:35'),
(179, 31, 'French Poodle', 5, 4, '2025-12-23 21:18:35'),
(180, 31, 'Salchicha', 3, 5, '2025-12-23 21:18:35'),
(181, 32, 'Pagar deudas', 38, 1, '2025-12-23 21:18:35'),
(182, 32, 'Viajar', 31, 2, '2025-12-23 21:18:35'),
(183, 32, 'Comprar una casa', 23, 3, '2025-12-23 21:18:35'),
(184, 32, 'Hacer donaciones', 5, 4, '2025-12-23 21:18:35'),
(185, 32, 'Salirse de trabajar', 3, 5, '2025-12-23 21:18:35'),
(186, 33, 'Gelatina', 48, 1, '2025-12-23 21:25:54'),
(187, 33, 'Dulce', 25, 2, '2025-12-23 21:25:54'),
(188, 33, 'Ostion', 11, 3, '2025-12-23 21:25:54'),
(189, 33, 'Pastillas', 7, 4, '2025-12-23 21:25:54'),
(190, 33, 'Yogurt', 7, 5, '2025-12-23 21:25:54'),
(191, 34, 'Tortura', 34, 1, '2025-12-23 21:25:54'),
(192, 34, 'Brujería / Brujas', 28, 2, '2025-12-23 21:25:54'),
(193, 34, 'Iglesia / Religión', 21, 3, '2025-12-23 21:25:54'),
(194, 34, 'Quema a las personas', 12, 4, '2025-12-23 21:25:54'),
(195, 34, 'Aparatos de tortura', 5, 5, '2025-12-23 21:25:54'),
(196, 35, 'Matemáticas', 28, 1, '2025-12-23 21:25:54'),
(197, 35, 'Historia', 26, 2, '2025-12-23 21:25:54'),
(198, 35, 'Física', 23, 3, '2025-12-23 21:25:54'),
(199, 35, 'Química', 15, 4, '2025-12-23 21:25:54'),
(200, 35, 'Inglés', 8, 5, '2025-12-23 21:25:54'),
(201, 36, 'Ceja', 38, 1, '2025-12-23 21:25:54'),
(202, 36, 'Ombligo', 23, 2, '2025-12-23 21:25:54'),
(203, 36, 'Lengua', 12, 3, '2025-12-23 21:25:54'),
(204, 36, 'Nariz', 11, 4, '2025-12-23 21:25:54'),
(205, 36, 'Labio', 9, 5, '2025-12-23 21:25:54'),
(206, 37, 'Perro', 33, 1, '2025-12-23 21:30:27'),
(207, 37, 'Gato', 30, 2, '2025-12-23 21:30:27'),
(208, 37, 'Canarios', 27, 3, '2025-12-23 21:30:27'),
(209, 37, 'Roedores', 7, 4, '2025-12-23 21:30:27'),
(210, 37, 'Peces', 3, 5, '2025-12-23 21:30:27'),
(211, 38, 'Gallina/Gallo', 38, 1, '2025-12-23 21:30:27'),
(212, 38, 'Pato', 31, 2, '2025-12-23 21:30:27'),
(213, 38, 'Colibrí', 23, 3, '2025-12-23 21:30:27'),
(214, 38, 'Águila', 5, 4, '2025-12-23 21:30:27'),
(215, 38, 'Halcón', 3, 5, '2025-12-23 21:30:27'),
(216, 39, 'Ropa', 41, 1, '2025-12-23 21:30:27'),
(217, 39, 'Zapatos', 38, 2, '2025-12-23 21:30:27'),
(218, 39, 'Perfumes', 13, 3, '2025-12-23 21:30:27'),
(219, 39, 'Maquillaje', 5, 4, '2025-12-23 21:30:27'),
(220, 39, 'Accesorios', 3, 5, '2025-12-23 21:30:27'),
(221, 40, 'Tiburón', 28, 1, '2025-12-23 21:30:27'),
(222, 40, 'Cocodrilo', 26, 2, '2025-12-23 21:30:27'),
(223, 40, 'Tigre', 23, 3, '2025-12-23 21:30:27'),
(224, 40, 'Puma', 13, 4, '2025-12-23 21:30:27'),
(225, 40, 'Hiena', 10, 5, '2025-12-23 21:30:27'),
(226, 41, 'Pesquero', 75, 1, '2025-12-23 21:51:27'),
(227, 41, 'Petrolero', 10, 2, '2025-12-23 21:51:27'),
(228, 41, 'Bote/Lancha', 7, 3, '2025-12-23 21:51:27'),
(229, 41, 'Buque', 4, 4, '2025-12-23 21:51:27'),
(230, 41, 'Crucero', 4, 5, '2025-12-23 21:51:27'),
(231, 42, 'Dijes', 29, 1, '2025-12-23 21:51:27'),
(232, 42, 'Rosario', 28, 2, '2025-12-23 21:51:27'),
(233, 42, 'Calcomanias', 26, 3, '2025-12-23 21:51:27'),
(234, 42, 'Dados', 9, 4, '2025-12-23 21:51:27'),
(235, 42, 'Peluche', 8, 5, '2025-12-23 21:51:27'),
(236, 43, 'Vampiro', 37, 1, '2025-12-23 21:51:27'),
(237, 43, 'Bruja', 31, 2, '2025-12-23 21:51:27'),
(238, 43, 'Calabaza', 24, 3, '2025-12-23 21:51:27'),
(239, 43, 'Momia', 5, 4, '2025-12-23 21:51:27'),
(240, 43, 'Calavera', 3, 5, '2025-12-23 21:51:27'),
(241, 44, 'Buey', 38, 1, '2025-12-23 21:51:27'),
(242, 44, 'Cerdo', 29, 2, '2025-12-23 21:51:27'),
(243, 44, 'Burro', 21, 3, '2025-12-23 21:51:27'),
(244, 44, 'Perro', 8, 4, '2025-12-23 21:51:27'),
(245, 44, 'Gato', 4, 5, '2025-12-23 21:51:27'),
(246, 45, 'Piñata', 36, 1, '2025-12-23 22:00:33'),
(247, 45, 'Pastel', 21, 2, '2025-12-23 22:00:33'),
(248, 45, 'Globos', 17, 3, '2025-12-23 22:00:33'),
(249, 45, 'Payasos', 15, 4, '2025-12-23 22:00:33'),
(250, 45, 'Regalos', 11, 5, '2025-12-23 22:00:33'),
(251, 46, 'Alumnos', 41, 1, '2025-12-23 22:00:33'),
(252, 46, 'Maestros', 38, 2, '2025-12-23 22:00:33'),
(253, 46, 'Pizarrón', 14, 3, '2025-12-23 22:00:33'),
(254, 46, 'Bancas', 5, 4, '2025-12-23 22:00:33'),
(255, 46, 'Cuadernos/Libros', 2, 5, '2025-12-23 22:00:33'),
(256, 47, 'MiniFalda', 40, 1, '2025-12-23 22:00:33'),
(257, 47, 'Cirugía Plástica', 27, 2, '2025-12-23 22:00:33'),
(258, 47, 'Escotes Pronunciados', 18, 3, '2025-12-23 22:00:33'),
(259, 47, 'Perforaciones en el Cuerpo', 9, 4, '2025-12-23 22:00:33'),
(260, 47, 'Tatuajes', 6, 5, '2025-12-23 22:00:33'),
(261, 48, 'Hacer Ejercicio', 41, 1, '2025-12-23 22:00:33'),
(262, 48, 'Bajar de Peso', 24, 2, '2025-12-23 22:00:33'),
(263, 48, 'Dejar de Fumar', 13, 3, '2025-12-23 22:00:33'),
(264, 48, 'Ahorrar', 9, 4, '2025-12-23 22:00:33'),
(265, 48, 'Viajar', 7, 5, '2025-12-23 22:00:33'),
(266, 49, 'Piñata', 27, 1, '2025-12-23 22:02:59'),
(267, 49, 'Ponche', 23, 2, '2025-12-23 22:02:59'),
(268, 49, 'Letanías', 20, 3, '2025-12-23 22:02:59'),
(269, 49, 'Peregrinos', 18, 4, '2025-12-23 22:02:59'),
(270, 49, 'Velas/Luces de Bengala', 12, 5, '2025-12-23 22:02:59'),
(271, 50, 'Bombero', 40, 1, '2025-12-23 22:02:59'),
(272, 50, 'Albañil', 33, 2, '2025-12-23 22:02:59'),
(273, 50, 'Chofer', 9, 3, '2025-12-23 22:02:59'),
(274, 50, 'Herrero', 9, 4, '2025-12-23 22:02:59'),
(275, 50, 'Ingeniero', 9, 5, '2025-12-23 22:02:59'),
(276, 51, 'Elefante', 38, 1, '2025-12-23 22:02:59'),
(277, 51, 'Jirafa', 31, 2, '2025-12-23 22:02:59'),
(278, 51, 'Ballena', 23, 3, '2025-12-23 22:02:59'),
(279, 51, 'Caballo', 5, 4, '2025-12-23 22:02:59'),
(280, 51, 'Dinosaurio', 3, 5, '2025-12-23 22:02:59'),
(281, 52, 'Trompo', 38, 1, '2025-12-23 22:02:59'),
(282, 52, 'Balero', 36, 2, '2025-12-23 22:02:59'),
(283, 52, 'Yoyo', 15, 3, '2025-12-23 22:02:59'),
(284, 52, 'Matatena', 8, 4, '2025-12-23 22:02:59'),
(285, 52, 'Lotería', 3, 5, '2025-12-23 22:02:59'),
(286, 2, 'Como habla', 38, 1, '2025-12-23 22:04:29'),
(287, 2, 'Ropa', 31, 2, '2025-12-23 22:04:29'),
(288, 2, 'Música que escucha', 23, 3, '2025-12-23 22:04:29'),
(289, 2, 'Peinado', 5, 4, '2025-12-23 22:04:29'),
(290, 2, 'Accesorios', 3, 5, '2025-12-23 22:04:29'),
(291, 53, 'Boxeador', 26, 1, '2025-12-23 22:11:54'),
(292, 53, 'Electricista', 24, 2, '2025-12-23 22:11:54'),
(293, 53, 'Doctor', 19, 3, '2025-12-23 22:11:54'),
(294, 53, 'Dentista', 17, 4, '2025-12-23 22:11:54'),
(295, 53, 'Jardinero', 13, 5, '2025-12-23 22:11:54'),
(296, 54, 'Bombero', 36, 1, '2025-12-23 22:11:54'),
(297, 54, 'Policía', 33, 2, '2025-12-23 22:11:54'),
(298, 54, 'Doctor', 17, 3, '2025-12-23 22:11:54'),
(299, 54, 'Maestra', 12, 4, '2025-12-23 22:11:54'),
(300, 54, 'Astronauta', 2, 5, '2025-12-23 22:11:54'),
(301, 55, 'Moscas', 36, 1, '2025-12-23 22:11:54'),
(302, 55, 'Cucarachas', 33, 2, '2025-12-23 22:11:54'),
(303, 55, 'Moscos', 17, 3, '2025-12-23 22:11:54'),
(304, 55, 'Ratas', 12, 4, '2025-12-23 22:11:54'),
(305, 55, 'Hormigas', 2, 5, '2025-12-23 22:11:54'),
(306, 56, 'Felipe Calderón', 40, 1, '2025-12-23 22:11:54'),
(307, 56, 'Carlos Salinas', 27, 2, '2025-12-23 22:11:54'),
(308, 56, 'Vicente Fox', 19, 3, '2025-12-23 22:11:54'),
(309, 56, 'Luis Echeverría', 6, 4, '2025-12-23 22:11:54'),
(310, 56, 'Porfirio Díaz', 2, 5, '2025-12-23 22:11:54'),
(311, 57, 'Serpiente', 35, 1, '2026-01-27 21:41:58'),
(312, 57, 'Araña', 25, 2, '2026-01-27 21:41:58'),
(313, 57, 'Escorpión', 20, 3, '2026-01-27 21:41:58'),
(314, 57, 'Abeja', 10, 4, '2026-01-27 21:41:58'),
(315, 57, 'Alacrán', 10, 5, '2026-01-27 21:41:58');

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `rounds`
--

CREATE TABLE `rounds` (
  `id` int NOT NULL,
  `game_id` int NOT NULL,
  `question_id` int NOT NULL,
  `round_number` int NOT NULL,
  `multiplier` int DEFAULT '1',
  `team_in_turn` enum('A','B') DEFAULT 'A',
  `team_a_round_points` int DEFAULT '0',
  `team_b_round_points` int DEFAULT '0',
  `state` enum('not_started','in_progress','finished') DEFAULT 'not_started',
  `strikes_team_a` int DEFAULT '0',
  `strikes_team_b` int DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Volcado de datos para la tabla `rounds`
--

INSERT INTO `rounds` (`id`, `game_id`, `question_id`, `round_number`, `multiplier`, `team_in_turn`, `team_a_round_points`, `team_b_round_points`, `state`, `strikes_team_a`, `strikes_team_b`, `created_at`, `updated_at`) VALUES
(1, 3, 14, 1, 1, 'A', 0, 0, 'finished', 3, 0, '2025-12-25 03:03:13', '2025-12-25 03:23:12'),
(2, 3, 1, 2, 2, 'B', 0, 0, 'finished', 2, 0, '2025-12-25 03:23:21', '2025-12-25 03:39:17'),
(3, 3, 25, 3, 1, 'A', 0, 0, 'finished', 2, 0, '2025-12-25 03:39:24', '2025-12-25 03:53:53'),
(4, 3, 43, 4, 1, 'A', 0, 0, 'in_progress', 0, 0, '2025-12-25 03:53:59', '2025-12-25 03:53:59'),
(5, 4, 20, 1, 1, 'A', 0, 0, 'finished', 1, 3, '2025-12-25 06:52:45', '2025-12-25 06:55:24'),
(6, 4, 1, 2, 2, 'B', 0, 0, 'finished', 0, 2, '2025-12-25 06:55:59', '2025-12-25 06:58:23'),
(7, 4, 43, 3, 1, 'A', 0, 0, 'finished', 2, 0, '2025-12-25 06:58:33', '2025-12-25 07:02:09'),
(8, 4, 51, 4, 1, 'B', 0, 0, 'finished', 3, 1, '2025-12-25 07:02:40', '2025-12-25 07:05:43'),
(9, 4, 45, 5, 1, 'B', 0, 0, 'finished', 3, 0, '2025-12-25 07:06:08', '2025-12-25 07:08:05'),
(10, 5, 30, 1, 1, 'B', 0, 0, 'finished', 0, 3, '2025-12-25 07:13:09', '2025-12-25 07:16:43'),
(11, 5, 47, 2, 2, 'A', 0, 0, 'finished', 1, 3, '2025-12-25 07:17:32', '2025-12-25 07:21:56'),
(12, 5, 6, 3, 1, 'A', 0, 0, 'in_progress', 0, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(13, 5, 11, 4, 1, 'A', 0, 0, 'in_progress', 0, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(14, 5, 48, 4, 1, 'A', 0, 0, 'in_progress', 0, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(15, 5, 47, 5, 1, 'A', 0, 0, 'in_progress', 0, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(16, 5, 52, 5, 1, 'A', 0, 0, 'in_progress', 0, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(17, 5, 7, 6, 1, 'A', 0, 0, 'in_progress', 0, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(18, 5, 19, 6, 1, 'A', 0, 0, 'in_progress', 0, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(19, 5, 43, 7, 3, 'A', 0, 0, 'in_progress', 0, 0, '2025-12-25 07:22:45', '2025-12-25 07:22:45'),
(20, 5, 21, 8, 3, 'A', 0, 0, 'finished', 0, 0, '2025-12-25 07:22:51', '2025-12-25 07:30:05'),
(21, 5, 52, 9, 3, 'B', 0, 0, 'finished', 1, 3, '2025-12-25 07:33:56', '2025-12-25 07:36:12'),
(22, 5, 55, 10, 3, 'A', 0, 0, 'finished', 2, 0, '2025-12-25 07:36:46', '2025-12-25 07:41:12'),
(23, 5, 27, 11, 1, 'A', 0, 0, 'in_progress', 0, 0, '2025-12-25 07:41:20', '2025-12-25 07:41:20'),
(24, 4, 30, 6, 1, 'A', 0, 0, 'finished', 2, 0, '2026-01-03 20:06:58', '2026-01-03 20:08:25'),
(25, 6, 49, 1, 1, 'A', 0, 0, 'finished', 3, 1, '2026-01-03 20:19:08', '2026-01-03 20:21:10'),
(26, 6, 1, 2, 1, 'A', 0, 0, 'finished', 1, 3, '2026-01-03 20:21:49', '2026-01-03 20:23:28'),
(27, 6, 41, 3, 1, 'B', 0, 0, 'finished', 0, 2, '2026-01-03 20:24:08', '2026-01-03 20:26:37'),
(28, 6, 34, 4, 1, 'A', 0, 0, 'finished', 1, 0, '2026-01-03 20:27:10', '2026-01-03 20:29:01'),
(29, 6, 33, 5, 2, 'B', 0, 0, 'finished', 1, 3, '2026-01-03 20:30:44', '2026-01-03 20:32:21'),
(30, 6, 48, 6, 2, 'A', 0, 0, 'finished', 0, 3, '2026-01-03 20:33:07', '2026-01-03 20:34:34'),
(31, 7, 15, 1, 1, 'B', 0, 0, 'finished', 3, 0, '2026-01-03 20:40:50', '2026-01-03 20:42:18'),
(32, 7, 34, 2, 2, 'A', 0, 0, 'in_progress', 0, 0, '2026-01-03 20:43:30', '2026-01-03 20:43:30'),
(33, 7, 23, 3, 2, 'B', 0, 0, 'finished', 0, 3, '2026-01-03 20:43:40', '2026-01-03 20:45:06'),
(34, 7, 19, 4, 3, 'A', 0, 0, 'finished', 0, 0, '2026-01-03 20:47:07', '2026-01-03 20:48:00'),
(35, 7, 5, 5, 3, 'B', 0, 0, 'finished', 3, 1, '2026-01-03 20:48:33', '2026-01-03 20:50:18'),
(36, 8, 54, 1, 1, 'A', 0, 0, 'in_progress', 0, 0, '2026-03-14 04:33:48', '2026-03-14 04:37:08'),
(37, 9, 27, 1, 1, 'A', 0, 0, 'finished', 0, 0, '2026-03-14 05:00:02', '2026-03-14 05:06:54'),
(38, 9, 29, 2, 3, 'A', 0, 0, 'finished', 0, 0, '2026-03-14 05:07:59', '2026-03-14 05:08:18'),
(39, 9, 15, 3, 1, 'A', 0, 0, 'in_progress', 0, 0, '2026-03-14 05:08:44', '2026-03-14 05:08:44'),
(40, 9, 36, 4, 1, 'A', 0, 0, 'in_progress', 0, 0, '2026-03-14 05:31:24', '2026-03-14 05:31:24'),
(41, 10, 1, 1, 1, 'B', 0, 0, 'finished', 0, 0, '2026-03-14 05:43:47', '2026-03-14 05:45:07'),
(42, 10, 51, 2, 1, 'A', 0, 0, 'finished', 0, 0, '2026-03-14 05:48:37', '2026-03-14 05:49:05'),
(43, 10, 37, 2, 1, 'A', 0, 0, 'finished', 0, 0, '2026-03-14 05:48:37', '2026-03-14 05:49:04'),
(44, 10, 31, 3, 1, 'A', 0, 0, 'finished', 0, 0, '2026-03-14 05:48:39', '2026-03-14 05:49:04'),
(45, 10, 32, 1, 1, 'B', 0, 0, 'finished', 1, 2, '2026-03-14 05:50:00', '2026-03-14 05:57:26'),
(46, 10, 27, 2, 2, 'A', 0, 0, 'finished', 0, 0, '2026-03-14 05:57:38', '2026-03-14 05:57:56');

-- --------------------------------------------------------

--
-- Estructura de tabla para la tabla `round_answer_state`
--

CREATE TABLE `round_answer_state` (
  `id` int NOT NULL,
  `round_id` int NOT NULL,
  `question_answer_id` int NOT NULL,
  `is_revealed` tinyint(1) DEFAULT '0',
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;

--
-- Volcado de datos para la tabla `round_answer_state`
--

INSERT INTO `round_answer_state` (`id`, `round_id`, `question_answer_id`, `is_revealed`, `created_at`, `updated_at`) VALUES
(1, 1, 91, 1, '2025-12-25 03:03:13', '2025-12-25 03:22:37'),
(2, 1, 92, 1, '2025-12-25 03:03:14', '2025-12-25 03:22:25'),
(3, 1, 93, 0, '2025-12-25 03:03:14', '2025-12-25 03:03:14'),
(4, 1, 94, 0, '2025-12-25 03:03:14', '2025-12-25 03:03:14'),
(5, 1, 95, 0, '2025-12-25 03:03:14', '2025-12-25 03:03:14'),
(10, 2, 1, 1, '2025-12-25 03:23:21', '2025-12-25 03:38:10'),
(11, 2, 2, 1, '2025-12-25 03:23:21', '2025-12-25 03:38:48'),
(12, 2, 3, 1, '2025-12-25 03:23:21', '2025-12-25 03:38:51'),
(13, 2, 4, 0, '2025-12-25 03:23:21', '2025-12-25 03:37:20'),
(14, 2, 5, 0, '2025-12-25 03:23:21', '2025-12-25 03:37:19'),
(30, 3, 146, 1, '2025-12-25 03:39:24', '2025-12-25 03:53:02'),
(31, 3, 147, 1, '2025-12-25 03:39:24', '2025-12-25 03:53:31'),
(32, 3, 148, 1, '2025-12-25 03:39:24', '2025-12-25 03:53:42'),
(33, 3, 149, 0, '2025-12-25 03:39:24', '2025-12-25 03:39:24'),
(34, 3, 150, 0, '2025-12-25 03:39:24', '2025-12-25 03:39:50'),
(42, 4, 236, 0, '2025-12-25 03:53:59', '2025-12-25 03:53:59'),
(43, 4, 237, 0, '2025-12-25 03:53:59', '2025-12-25 03:53:59'),
(44, 4, 238, 0, '2025-12-25 03:53:59', '2025-12-25 03:53:59'),
(45, 4, 239, 0, '2025-12-25 03:53:59', '2025-12-25 03:53:59'),
(46, 4, 240, 0, '2025-12-25 03:53:59', '2025-12-25 03:53:59'),
(47, 5, 121, 1, '2025-12-25 06:52:45', '2025-12-25 06:55:34'),
(48, 5, 122, 1, '2025-12-25 06:52:45', '2025-12-25 06:54:01'),
(49, 5, 123, 1, '2025-12-25 06:52:45', '2025-12-25 06:55:40'),
(50, 5, 124, 1, '2025-12-25 06:52:45', '2025-12-25 06:55:46'),
(51, 5, 125, 1, '2025-12-25 06:52:45', '2025-12-25 06:55:50'),
(57, 6, 1, 1, '2025-12-25 06:55:59', '2025-12-25 06:56:22'),
(58, 6, 2, 1, '2025-12-25 06:55:59', '2025-12-25 06:58:17'),
(59, 6, 3, 1, '2025-12-25 06:55:59', '2025-12-25 06:56:42'),
(60, 6, 4, 1, '2025-12-25 06:55:59', '2025-12-25 06:57:59'),
(61, 6, 5, 1, '2025-12-25 06:55:59', '2025-12-25 06:57:08'),
(67, 7, 236, 1, '2025-12-25 06:58:33', '2025-12-25 07:02:03'),
(68, 7, 237, 1, '2025-12-25 06:58:33', '2025-12-25 06:59:42'),
(69, 7, 238, 1, '2025-12-25 06:58:33', '2025-12-25 06:59:21'),
(70, 7, 239, 1, '2025-12-25 06:58:33', '2025-12-25 07:00:22'),
(71, 7, 240, 1, '2025-12-25 06:58:33', '2025-12-25 06:59:35'),
(77, 8, 276, 1, '2025-12-25 07:02:40', '2025-12-25 07:03:00'),
(78, 8, 277, 1, '2025-12-25 07:02:40', '2025-12-25 07:04:02'),
(79, 8, 278, 1, '2025-12-25 07:02:40', '2025-12-25 07:03:10'),
(80, 8, 279, 1, '2025-12-25 07:02:40', '2025-12-25 07:05:51'),
(81, 8, 280, 1, '2025-12-25 07:02:40', '2025-12-25 07:03:47'),
(88, 9, 246, 1, '2025-12-25 07:06:08', '2025-12-25 07:08:00'),
(89, 9, 247, 1, '2025-12-25 07:06:08', '2025-12-25 07:06:26'),
(90, 9, 248, 1, '2025-12-25 07:06:08', '2025-12-25 07:07:14'),
(91, 9, 249, 1, '2025-12-25 07:06:08', '2025-12-25 07:07:22'),
(92, 9, 250, 1, '2025-12-25 07:06:08', '2025-12-25 07:08:18'),
(98, 10, 171, 1, '2025-12-25 07:13:09', '2025-12-25 07:16:32'),
(99, 10, 172, 1, '2025-12-25 07:13:09', '2025-12-25 07:16:34'),
(100, 10, 173, 1, '2025-12-25 07:13:09', '2025-12-25 07:15:42'),
(101, 10, 174, 1, '2025-12-25 07:13:09', '2025-12-25 07:16:52'),
(102, 10, 175, 1, '2025-12-25 07:13:09', '2025-12-25 07:16:59'),
(110, 11, 256, 1, '2025-12-25 07:17:32', '2025-12-25 07:18:01'),
(111, 11, 257, 1, '2025-12-25 07:17:32', '2025-12-25 07:22:08'),
(112, 11, 258, 1, '2025-12-25 07:17:32', '2025-12-25 07:18:17'),
(113, 11, 259, 1, '2025-12-25 07:17:32', '2025-12-25 07:19:27'),
(114, 11, 260, 1, '2025-12-25 07:17:32', '2025-12-25 07:19:15'),
(120, 12, 36, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(121, 12, 37, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(122, 12, 38, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(123, 12, 39, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(124, 12, 40, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(125, 13, 61, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(126, 13, 62, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(127, 13, 63, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(128, 13, 64, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(129, 13, 65, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(130, 14, 261, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(131, 14, 262, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(132, 14, 263, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(133, 14, 264, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(134, 14, 265, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(135, 15, 256, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(136, 16, 281, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(137, 15, 257, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(138, 16, 282, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(139, 15, 258, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(140, 16, 283, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(141, 15, 259, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(142, 16, 284, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(143, 15, 260, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(144, 16, 285, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(145, 17, 41, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(146, 17, 42, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(147, 18, 116, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(148, 17, 43, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(149, 18, 117, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(150, 17, 44, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(151, 18, 118, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(152, 17, 45, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(153, 18, 119, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(154, 18, 120, 0, '2025-12-25 07:22:43', '2025-12-25 07:22:43'),
(155, 19, 236, 0, '2025-12-25 07:22:45', '2025-12-25 07:22:45'),
(156, 19, 237, 0, '2025-12-25 07:22:45', '2025-12-25 07:22:45'),
(157, 19, 238, 0, '2025-12-25 07:22:45', '2025-12-25 07:22:45'),
(158, 19, 239, 0, '2025-12-25 07:22:45', '2025-12-25 07:22:45'),
(159, 19, 240, 0, '2025-12-25 07:22:45', '2025-12-25 07:22:45'),
(160, 20, 126, 1, '2025-12-25 07:22:51', '2025-12-25 07:23:42'),
(161, 20, 127, 1, '2025-12-25 07:22:51', '2025-12-25 07:24:58'),
(162, 20, 128, 1, '2025-12-25 07:22:51', '2025-12-25 07:26:52'),
(163, 20, 129, 1, '2025-12-25 07:22:51', '2025-12-25 07:23:31'),
(164, 20, 130, 1, '2025-12-25 07:22:51', '2025-12-25 07:24:46'),
(170, 21, 281, 1, '2025-12-25 07:33:56', '2025-12-25 07:34:13'),
(171, 21, 282, 1, '2025-12-25 07:33:56', '2025-12-25 07:34:34'),
(172, 21, 283, 1, '2025-12-25 07:33:56', '2025-12-25 07:34:25'),
(173, 21, 284, 1, '2025-12-25 07:33:56', '2025-12-25 07:35:04'),
(174, 21, 285, 1, '2025-12-25 07:33:56', '2025-12-25 07:36:08'),
(182, 22, 301, 1, '2025-12-25 07:36:46', '2025-12-25 07:38:35'),
(183, 22, 302, 1, '2025-12-25 07:36:46', '2025-12-25 07:40:22'),
(184, 22, 303, 1, '2025-12-25 07:36:46', '2025-12-25 07:38:24'),
(185, 22, 304, 1, '2025-12-25 07:36:46', '2025-12-25 07:39:12'),
(186, 22, 305, 1, '2025-12-25 07:36:46', '2025-12-25 07:41:05'),
(202, 23, 156, 0, '2025-12-25 07:41:20', '2025-12-25 07:41:20'),
(203, 23, 157, 0, '2025-12-25 07:41:20', '2025-12-25 07:41:20'),
(204, 23, 158, 0, '2025-12-25 07:41:20', '2025-12-25 07:41:20'),
(205, 23, 159, 0, '2025-12-25 07:41:20', '2025-12-25 07:41:20'),
(206, 23, 160, 0, '2025-12-25 07:41:20', '2025-12-25 07:41:20'),
(207, 24, 171, 1, '2026-01-03 20:06:58', '2026-01-03 20:07:31'),
(208, 24, 172, 0, '2026-01-03 20:06:58', '2026-01-03 20:06:58'),
(209, 24, 173, 1, '2026-01-03 20:06:58', '2026-01-03 20:07:17'),
(210, 24, 174, 1, '2026-01-03 20:06:58', '2026-01-03 20:07:37'),
(211, 24, 175, 0, '2026-01-03 20:06:58', '2026-01-03 20:06:58'),
(215, 25, 266, 1, '2026-01-03 20:19:08', '2026-01-03 20:19:29'),
(216, 25, 267, 1, '2026-01-03 20:19:08', '2026-01-03 20:19:47'),
(217, 25, 268, 1, '2026-01-03 20:19:08', '2026-01-03 20:20:26'),
(218, 25, 269, 1, '2026-01-03 20:19:08', '2026-01-03 20:21:19'),
(219, 25, 270, 1, '2026-01-03 20:19:08', '2026-01-03 20:20:11'),
(225, 26, 1, 1, '2026-01-03 20:21:49', '2026-01-03 20:22:08'),
(226, 26, 2, 1, '2026-01-03 20:21:49', '2026-01-03 20:23:35'),
(227, 26, 3, 1, '2026-01-03 20:21:49', '2026-01-03 20:23:41'),
(228, 26, 4, 1, '2026-01-03 20:21:49', '2026-01-03 20:22:26'),
(229, 26, 5, 1, '2026-01-03 20:21:49', '2026-01-03 20:22:20'),
(235, 27, 226, 1, '2026-01-03 20:24:08', '2026-01-03 20:24:27'),
(236, 27, 227, 1, '2026-01-03 20:24:08', '2026-01-03 20:25:27'),
(237, 27, 228, 1, '2026-01-03 20:24:08', '2026-01-03 20:26:34'),
(238, 27, 229, 1, '2026-01-03 20:24:08', '2026-01-03 20:24:56'),
(239, 27, 230, 1, '2026-01-03 20:24:08', '2026-01-03 20:24:33'),
(245, 28, 191, 1, '2026-01-03 20:27:10', '2026-01-03 20:27:37'),
(246, 28, 192, 1, '2026-01-03 20:27:10', '2026-01-03 20:28:59'),
(247, 28, 193, 1, '2026-01-03 20:27:10', '2026-01-03 20:28:52'),
(248, 28, 194, 1, '2026-01-03 20:27:10', '2026-01-03 20:27:25'),
(249, 28, 195, 1, '2026-01-03 20:27:10', '2026-01-03 20:28:14'),
(255, 29, 186, 1, '2026-01-03 20:30:44', '2026-01-03 20:31:07'),
(256, 29, 187, 1, '2026-01-03 20:30:44', '2026-01-03 20:32:29'),
(257, 29, 188, 1, '2026-01-03 20:30:44', '2026-01-03 20:32:34'),
(258, 29, 189, 1, '2026-01-03 20:30:44', '2026-01-03 20:32:39'),
(259, 29, 190, 1, '2026-01-03 20:30:44', '2026-01-03 20:32:43'),
(265, 30, 261, 1, '2026-01-03 20:33:07', '2026-01-03 20:33:42'),
(266, 30, 262, 1, '2026-01-03 20:33:07', '2026-01-03 20:33:21'),
(267, 30, 263, 1, '2026-01-03 20:33:07', '2026-01-03 20:34:42'),
(268, 30, 264, 1, '2026-01-03 20:33:07', '2026-01-03 20:34:02'),
(269, 30, 265, 1, '2026-01-03 20:33:07', '2026-01-03 20:34:30'),
(275, 31, 96, 1, '2026-01-03 20:40:50', '2026-01-03 20:41:03'),
(276, 31, 97, 1, '2026-01-03 20:40:50', '2026-01-03 20:42:14'),
(277, 31, 98, 1, '2026-01-03 20:40:50', '2026-01-03 20:41:19'),
(278, 31, 99, 1, '2026-01-03 20:40:50', '2026-01-03 20:42:31'),
(279, 31, 100, 1, '2026-01-03 20:40:50', '2026-01-03 20:41:09'),
(285, 32, 191, 0, '2026-01-03 20:43:30', '2026-01-03 20:43:30'),
(286, 32, 192, 0, '2026-01-03 20:43:30', '2026-01-03 20:43:30'),
(287, 32, 193, 0, '2026-01-03 20:43:30', '2026-01-03 20:43:30'),
(288, 32, 194, 0, '2026-01-03 20:43:30', '2026-01-03 20:43:30'),
(289, 32, 195, 0, '2026-01-03 20:43:30', '2026-01-03 20:43:30'),
(290, 33, 136, 1, '2026-01-03 20:43:40', '2026-01-03 20:44:39'),
(291, 33, 137, 1, '2026-01-03 20:43:40', '2026-01-03 20:45:03'),
(292, 33, 138, 1, '2026-01-03 20:43:40', '2026-01-03 20:46:13'),
(293, 33, 139, 1, '2026-01-03 20:43:40', '2026-01-03 20:43:54'),
(294, 33, 140, 1, '2026-01-03 20:43:40', '2026-01-03 20:46:18'),
(300, 34, 116, 1, '2026-01-03 20:47:07', '2026-01-03 20:47:43'),
(301, 34, 117, 1, '2026-01-03 20:47:07', '2026-01-03 20:47:20'),
(302, 34, 118, 1, '2026-01-03 20:47:07', '2026-01-03 20:47:38'),
(303, 34, 119, 1, '2026-01-03 20:47:07', '2026-01-03 20:47:58'),
(304, 34, 120, 1, '2026-01-03 20:47:07', '2026-01-03 20:47:29'),
(310, 35, 31, 1, '2026-01-03 20:48:33', '2026-01-03 20:49:04'),
(311, 35, 32, 1, '2026-01-03 20:48:33', '2026-01-03 20:49:50'),
(312, 35, 33, 1, '2026-01-03 20:48:33', '2026-01-03 20:48:56'),
(313, 35, 34, 1, '2026-01-03 20:48:33', '2026-01-03 20:49:15'),
(314, 35, 35, 1, '2026-01-03 20:48:33', '2026-01-03 20:50:25'),
(320, 36, 296, 0, '2026-03-14 04:33:48', '2026-03-14 04:52:56'),
(321, 36, 297, 0, '2026-03-14 04:33:48', '2026-03-14 04:49:53'),
(322, 36, 298, 0, '2026-03-14 04:33:48', '2026-03-14 04:49:42'),
(323, 36, 299, 0, '2026-03-14 04:33:48', '2026-03-14 04:49:43'),
(324, 36, 300, 0, '2026-03-14 04:33:48', '2026-03-14 04:36:50'),
(343, 37, 156, 1, '2026-03-14 05:00:02', '2026-03-14 05:00:09'),
(344, 37, 157, 1, '2026-03-14 05:00:02', '2026-03-14 05:03:26'),
(345, 37, 158, 1, '2026-03-14 05:00:02', '2026-03-14 05:03:25'),
(346, 37, 159, 1, '2026-03-14 05:00:02', '2026-03-14 05:03:26'),
(347, 37, 160, 1, '2026-03-14 05:00:02', '2026-03-14 05:03:27'),
(353, 38, 166, 1, '2026-03-14 05:07:59', '2026-03-14 05:08:06'),
(354, 38, 167, 1, '2026-03-14 05:07:59', '2026-03-14 05:08:07'),
(355, 38, 168, 1, '2026-03-14 05:07:59', '2026-03-14 05:08:08'),
(356, 38, 169, 1, '2026-03-14 05:07:59', '2026-03-14 05:08:09'),
(357, 38, 170, 1, '2026-03-14 05:07:59', '2026-03-14 05:08:10'),
(363, 39, 96, 0, '2026-03-14 05:08:44', '2026-03-14 05:31:22'),
(364, 39, 97, 0, '2026-03-14 05:08:44', '2026-03-14 05:08:44'),
(365, 39, 98, 0, '2026-03-14 05:08:44', '2026-03-14 05:08:44'),
(366, 39, 99, 0, '2026-03-14 05:08:44', '2026-03-14 05:08:44'),
(367, 39, 100, 0, '2026-03-14 05:08:44', '2026-03-14 05:08:44'),
(370, 40, 201, 0, '2026-03-14 05:31:24', '2026-03-14 05:31:24'),
(371, 40, 202, 0, '2026-03-14 05:31:24', '2026-03-14 05:31:24'),
(372, 40, 203, 0, '2026-03-14 05:31:24', '2026-03-14 05:31:24'),
(373, 40, 204, 0, '2026-03-14 05:31:24', '2026-03-14 05:31:24'),
(374, 40, 205, 0, '2026-03-14 05:31:24', '2026-03-14 05:31:24'),
(375, 41, 1, 1, '2026-03-14 05:43:47', '2026-03-14 05:43:52'),
(376, 41, 2, 1, '2026-03-14 05:43:47', '2026-03-14 05:43:53'),
(377, 41, 3, 1, '2026-03-14 05:43:47', '2026-03-14 05:43:54'),
(378, 41, 4, 0, '2026-03-14 05:43:47', '2026-03-14 05:43:47'),
(379, 41, 5, 0, '2026-03-14 05:43:47', '2026-03-14 05:43:47'),
(383, 42, 276, 0, '2026-03-14 05:48:37', '2026-03-14 05:48:37'),
(384, 43, 206, 0, '2026-03-14 05:48:37', '2026-03-14 05:48:37'),
(385, 42, 277, 0, '2026-03-14 05:48:37', '2026-03-14 05:48:37'),
(386, 43, 207, 0, '2026-03-14 05:48:37', '2026-03-14 05:48:37'),
(387, 42, 278, 0, '2026-03-14 05:48:37', '2026-03-14 05:48:37'),
(388, 43, 208, 0, '2026-03-14 05:48:37', '2026-03-14 05:48:37'),
(389, 42, 279, 0, '2026-03-14 05:48:37', '2026-03-14 05:48:37'),
(390, 43, 209, 0, '2026-03-14 05:48:37', '2026-03-14 05:48:37'),
(391, 42, 280, 0, '2026-03-14 05:48:37', '2026-03-14 05:48:37'),
(392, 43, 210, 0, '2026-03-14 05:48:37', '2026-03-14 05:48:37'),
(393, 44, 176, 0, '2026-03-14 05:48:39', '2026-03-14 05:48:39'),
(394, 44, 177, 0, '2026-03-14 05:48:39', '2026-03-14 05:48:39'),
(395, 44, 178, 0, '2026-03-14 05:48:39', '2026-03-14 05:48:39'),
(396, 44, 179, 0, '2026-03-14 05:48:39', '2026-03-14 05:48:39'),
(397, 44, 180, 0, '2026-03-14 05:48:39', '2026-03-14 05:48:39'),
(398, 45, 181, 1, '2026-03-14 05:50:00', '2026-03-14 05:57:02'),
(399, 45, 182, 1, '2026-03-14 05:50:00', '2026-03-14 05:57:03'),
(400, 45, 183, 1, '2026-03-14 05:50:00', '2026-03-14 05:57:05'),
(401, 45, 184, 0, '2026-03-14 05:50:00', '2026-03-14 05:50:00'),
(402, 45, 185, 0, '2026-03-14 05:50:00', '2026-03-14 05:50:00'),
(406, 46, 156, 1, '2026-03-14 05:57:38', '2026-03-14 05:57:46'),
(407, 46, 157, 1, '2026-03-14 05:57:38', '2026-03-14 05:57:47'),
(408, 46, 158, 0, '2026-03-14 05:57:38', '2026-03-14 05:57:38'),
(409, 46, 159, 1, '2026-03-14 05:57:39', '2026-03-14 05:57:49'),
(410, 46, 160, 0, '2026-03-14 05:57:39', '2026-03-14 05:57:39');

--
-- Índices para tablas volcadas
--

--
-- Indices de la tabla `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_is_active` (`is_active`);

--
-- Indices de la tabla `games`
--
ALTER TABLE `games`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_status` (`status`);

--
-- Indices de la tabla `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_category_active` (`category_id`,`is_active`);

--
-- Indices de la tabla `question_answers`
--
ALTER TABLE `question_answers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_question` (`question_id`);

--
-- Indices de la tabla `rounds`
--
ALTER TABLE `rounds`
  ADD PRIMARY KEY (`id`),
  ADD KEY `question_id` (`question_id`),
  ADD KEY `idx_game_round` (`game_id`,`round_number`);

--
-- Indices de la tabla `round_answer_state`
--
ALTER TABLE `round_answer_state`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_round_answer` (`round_id`,`question_answer_id`),
  ADD KEY `question_answer_id` (`question_answer_id`);

--
-- AUTO_INCREMENT de las tablas volcadas
--

--
-- AUTO_INCREMENT de la tabla `categories`
--
ALTER TABLE `categories`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=28;

--
-- AUTO_INCREMENT de la tabla `games`
--
ALTER TABLE `games`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=11;

--
-- AUTO_INCREMENT de la tabla `questions`
--
ALTER TABLE `questions`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;

--
-- AUTO_INCREMENT de la tabla `question_answers`
--
ALTER TABLE `question_answers`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=316;

--
-- AUTO_INCREMENT de la tabla `rounds`
--
ALTER TABLE `rounds`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;

--
-- AUTO_INCREMENT de la tabla `round_answer_state`
--
ALTER TABLE `round_answer_state`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=414;

--
-- Restricciones para tablas volcadas
--

--
-- Filtros para la tabla `questions`
--
ALTER TABLE `questions`
  ADD CONSTRAINT `questions_ibfk_1` FOREIGN KEY (`category_id`) REFERENCES `categories` (`id`) ON DELETE CASCADE;

--
-- Filtros para la tabla `question_answers`
--
ALTER TABLE `question_answers`
  ADD CONSTRAINT `question_answers_ibfk_1` FOREIGN KEY (`question_id`) REFERENCES `questions` (`id`) ON DELETE CASCADE;

--
-- Filtros para la tabla `rounds`
--
ALTER TABLE `rounds`
  ADD CONSTRAINT `rounds_ibfk_1` FOREIGN KEY (`game_id`) REFERENCES `games` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `rounds_ibfk_2` FOREIGN KEY (`question_id`) REFERENCES `questions` (`id`);

--
-- Filtros para la tabla `round_answer_state`
--
ALTER TABLE `round_answer_state`
  ADD CONSTRAINT `round_answer_state_ibfk_1` FOREIGN KEY (`round_id`) REFERENCES `rounds` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `round_answer_state_ibfk_2` FOREIGN KEY (`question_answer_id`) REFERENCES `question_answers` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
